<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"local","backend":"7a5d2b4a51c38b3e43dda8cc9592d1e06bafbfc91c4be68fd7afd591b77563c2","plan_job_ref":"Job Test terraform-refresh #7 at https://github.com/dflook/terraform-github-actions/actions/runs/14039587825","plan_out_hash":"dc4d5dcc67e03a443472d605f1cd18bc81a0ebd8ce25ffcb83006ad03484f21f","plan_hash":"47c669b91c7e5db7d19ea00123bc2a3f17fbf38d413748ce5dfa46fdc988cb0a","plan_text_format":"diff","version":"99.0.0"} -->
Terraform plan in __tests/workflows/test-refresh__
:recycle: Skipping refresh of resource state
<details>
<summary>Plan: 1 to add, 0 to change, 0 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create

Terraform will perform the following actions:

  # local_file.one will be created
+   resource "local_file" "one" {
+       content              = "this is my first file"
+       content_base64sha256 = (known after apply)
+       content_base64sha512 = (known after apply)
+       content_md5          = (known after apply)
+       content_sha1         = (known after apply)
+       content_sha256       = (known after apply)
+       content_sha512       = (known after apply)
+       directory_permission = "0777"
+       file_permission      = "0777"
+       filename             = "test"
+       id                   = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.
```
</details>

:memo: Plan generated in [Test terraform-refresh #7](https://github.com/dflook/terraform-github-actions/actions/runs/14039587825)